app/views/messages/_message.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  <i class="author text-muted">
    <span><%= message.user.first_name%></span>