app/views/dogs/index.html.erb

        <p class="text-muted">from <%= dog.suburb %></p>
        <p><i class="fas fa-walking"></i> <strong><%= dog.user.first_name %></strong></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]