app/views/dogs/show.html.erb

        <h5 class="card-title green-header py-2 pb-2 border-bottom"><strong><%= @dog.name %></strong></h5>
        <p class="light-blue-text">Lives with <strong><%= @dog.user.first_name %></strong> in <%= @dog.suburb %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]