app/views/chatrooms/index.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["chatroom_id", 1], ["LIMIT", 1]]
---
      <% end %>
      <% if chatroom.messages.last.nil? %>