app/views/chatrooms/index.html.erb

SELECT "dogs".* FROM "dogs" WHERE "dogs"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
            <% if current_user == chatroom.user1 %>
              <h4><%= link_to "#{chatroom.user2.dog.name} & #{chatroom.user2.first_name}", chatroom_path(chatroom), class: "chat-link" %></h4>

SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["chatroom_id", 1], ["LIMIT", 1]]
---
            <%# MESSAGES %>
            <% if chatroom.messages.last.nil? %>