app/views/chatrooms/show.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = $1  [["chatroom_id", 1]]
---
  <div id="messages" data-chatroom-id="<%= @chatroom.id %>">
    <% @chatroom.messages.each do |message| %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        <i class="author text-muted">
          <span><%= message.user.first_name%></span>

SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = $1  [["chatroom_id", 2]]
---
  <%= simple_form_for [ @chatroom, @message ], remote: true do |f| %>
    <%= f.input :content, label: false, placeholder: "Message ##{@chatroom.user2.first_name}" %>