SLACK/app/controllers/chatrooms_controller.rb

  def create
    @chatroom = Chatroom.new
    @user2 = User.find(params[:user_id])
    @chatroom.user1 = current_user
    @chatroom.user2 = @user2
    existing_chatroom = Chatroom.existing_chatroom_for(@user2, current_user)
    if existing_chatroom.nil?
      if @chatroom.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "chatrooms" ("user1_id", "user2_id") VALUES ($1, $2) RETURNING "id"  [["user1_id", 2], ["user2_id", 2]]

  def show
    @chatroom = Chatroom.find(params[:id])
---
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    @chatrooms = Chatroom.where(user1: current_user).or(Chatroom.where(user2: current_user))
---
SELECT "chatrooms".* FROM "chatrooms" WHERE ("chatrooms"."user1_id" = $1 OR "chatrooms"."user2_id" = $2)  [["user1_id", 2], ["user2_id", 2]]