SLACK/app/controllers/dogs_controller.rb

INSERT INTO "dogs" ("name", "birth_month", "birth_year", "gender", "size", "breed", "energy_level", "vaccinated", "neutered", "suburb", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @dog = Dog.new(dog_params)
    @dog.user = current_user
    if @dog.valid?
      @dog.save

UPDATE "dogs" SET "updated_at" = $1 WHERE "dogs"."id" = $2  [["updated_at", "2022-01-06 08:44:38.135701"], ["id", 1]]
---
  def update
    if @dog.update(dog_params)

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def toggle_favorite
    @dog = Dog.find_by(id: params[:id])