app/controllers/invitations_controller.rb

UPDATE "invitations" SET "status" = $1, "updated_at" = $2 WHERE "invitations"."id" = $3  [["status", "declined"], ["updated_at", "2022-01-08 04:30:21.216046"], ["id", 3]]
---
  def decline
    @invitation = Invitation.find(params[:id])
    @invitation.update(status: "declined")