app/controllers/invitations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @user2 = User.find(params[:user_id])

SELECT "invitations".* FROM "invitations" WHERE (invitations.user2 = #<User:0x00007fcee6a801f8>      AND invitations.status = 'accepted'      )
SELECT "invitations".* FROM "invitations" WHERE "invitations"."user2_id" = $1  [["user2_id", 1]]
---
  def index
    if (Invitation.where(status: "pending"))
      @invitations = Invitation.where(user2: current_user)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "invitations" ("address", "date_time", "details", "user1_id", "user2_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user2 = User.find(params[:user_id])
    @invitation = Invitation.new(invitation_params)
    @invitation.user1 = current_user
    @invitation.user2 = @user2
    if @invitation.save

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "invitations" SET "status" = $1, "updated_at" = $2 WHERE "invitations"."id" = $3  [["status", "accepted"], ["updated_at", "2022-01-22 05:15:25.288321"], ["id", 11]]
---
  def accept
    @invitation = Invitation.find(params[:id])
    @invitation.update(status: "accepted")

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "invitations" WHERE "invitations"."id" = $1  [["id", 7]]
---
  def decline
    @invitation = Invitation.find(params[:id])
    @invitation.destroy