app/controllers/messages_controller.rb

SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "chatroom_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "G'day how are ya"], ["chatroom_id", 1], ["user_id", 2], ["created_at", "2022-01-11 08:53:46.939740"], ["updated_at", "2022-01-11 08:53:46.939740"]]
---
  def create
    @chatroom = Chatroom.find(params[:chatroom_id])
    @message = Message.new(message_params)
    @message.chatroom = @chatroom
    @message.user = current_user
    if @message.save