app/models/chatroom.rb

  def self.existing_chatroom_for(user1, user2)
    Chatroom.where(user1: user1, user2: user2).or(Chatroom.where(user1: user2, user2: user1)).first
---
SELECT "chatrooms".* FROM "chatrooms" WHERE ("chatrooms"."user1_id" = $1 AND "chatrooms"."user2_id" = $2 OR "chatrooms"."user1_id" = $3 AND "chatrooms"."user2_id" = $4) ORDER BY "chatrooms"."id" ASC LIMIT $5  [["user1_id", 3], ["user2_id", 2], ["user1_id", 2], ["user2_id", 3], ["LIMIT", 1]]